# Pandas

## Series

In [58]:
import numpy as np
import pandas as pd

In [59]:
labels = ['a','b','c']
my_data = [1, 3, 5]
arr = np.array(my_data)

In [60]:
d = {'a':1, 'b':3, 'c':5}

In [61]:
pd.Series(data = my_data)

0    1
1    3
2    5
dtype: int64

In [62]:
pd.Series(data = my_data, index = labels)

a    1
b    3
c    5
dtype: int64

In [63]:
pd.Series(d)

a    1
b    3
c    5
dtype: int64

In [64]:
pd.Series([sum,print])

0      <built-in function sum>
1    <built-in function print>
dtype: object

In [65]:
pd.Series([1,2,3,5,5,5], ["USA","France","Russia", "Britain", "The Ukraine", "Japan"])

USA            1
France         2
Russia         3
Britain        5
The Ukraine    5
Japan          5
dtype: int64

In [218]:
ser1 = pd.Series([1,2,3,6,5,5], ["USA","France","Russia", "China", "The Ukraine", "Japan"])

In [67]:
ser2 = pd.Series([1,2,3,5,5,5], ["USA","France","Russia", "Britain", "The Ukraine", "Japan"])

In [220]:
ser1["USA"]

1

In [69]:
ser2[1]

2

In [70]:
ser2[1]

2

In [71]:
ser2[3]

5

In [72]:
ser2

USA            1
France         2
Russia         3
Britain        5
The Ukraine    5
Japan          5
dtype: int64

In [73]:
ser1

USA            1
France         2
Russia         3
China          6
The Ukraine    5
Japan          5
dtype: int64

In [74]:
ser1 + ser2

Britain         NaN
China           NaN
France          4.0
Japan          10.0
Russia          6.0
The Ukraine    10.0
USA             2.0
dtype: float64

In [75]:
ser1 * ser2

Britain         NaN
China           NaN
France          4.0
Japan          25.0
Russia          9.0
The Ukraine    25.0
USA             1.0
dtype: float64

## Dataframes part1

In [224]:
df = pd.DataFrame(np.random.randn(5,4), columns=['v','w','x','y'])

In [225]:
df

          v         w         x         y
0 -0.206005  0.865796 -0.984879  0.733905
1  0.202338 -0.343597 -0.010437  0.558518
2 -0.717097 -3.178568 -0.335627  0.439803
3  1.213460 -1.469129  1.319675 -0.385841
4  0.951967 -0.719409 -1.467336  0.976696

In [228]:
df['w']

0    0.865796
1   -0.343597
2   -3.178568
3   -1.469129
4   -0.719409
Name: w, dtype: float64

### A data frame is just a collection of series that share the same indicies

In [79]:
df.w

0   -0.357408
1    1.925787
2    0.598477
3   -0.221857
4    1.050522
Name: w, dtype: float64

In [80]:
df[['w','y']]

          w         y
0 -0.357408 -1.425949
1  1.925787 -0.132254
2  0.598477 -0.138165
3 -0.221857  1.390699
4  1.050522 -0.123459

In [81]:
df['new one homie'] = df['w'] + df['y']

In [82]:
df

          v         w         x         y  new one homie
0 -1.387738 -0.357408 -1.746762 -1.425949      -1.783357
1 -0.585942  1.925787 -0.773885 -0.132254       1.793532
2 -0.323312  0.598477 -1.029245 -0.138165       0.460312
3  0.996486 -0.221857  1.232692  1.390699       1.168842
4 -0.201879  1.050522 -1.071591 -0.123459       0.927063

In [83]:
df.drop(0, axis = 0)

          v         w         x         y  new one homie
1 -0.585942  1.925787 -0.773885 -0.132254       1.793532
2 -0.323312  0.598477 -1.029245 -0.138165       0.460312
3  0.996486 -0.221857  1.232692  1.390699       1.168842
4 -0.201879  1.050522 -1.071591 -0.123459       0.927063

In [84]:
df

          v         w         x         y  new one homie
0 -1.387738 -0.357408 -1.746762 -1.425949      -1.783357
1 -0.585942  1.925787 -0.773885 -0.132254       1.793532
2 -0.323312  0.598477 -1.029245 -0.138165       0.460312
3  0.996486 -0.221857  1.232692  1.390699       1.168842
4 -0.201879  1.050522 -1.071591 -0.123459       0.927063

In [85]:
df.drop('new one homie', axis=1, inplace=True)

In [86]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [87]:
df.drop(1)

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

### returning columns

In [88]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [89]:
df['v']

0   -1.387738
1   -0.585942
2   -0.323312
3    0.996486
4   -0.201879
Name: v, dtype: float64

### returning rows

In [90]:
df.loc[1]

v   -0.585942
w    1.925787
x   -0.773885
y   -0.132254
Name: 1, dtype: float64

In [91]:
df.loc[0,'w']

-0.35740768947589963

In [92]:
df.loc[0:2 , 'v']

0   -1.387738
1   -0.585942
2   -0.323312
Name: v, dtype: float64

## dataframes part2

In [93]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [94]:
df > 0

       v      w      x      y
0  False  False  False  False
1  False   True  False  False
2  False   True  False  False
3   True  False   True   True
4  False   True  False  False

In [95]:
booldf = df > 0

In [96]:
booldf

       v      w      x      y
0  False  False  False  False
1  False   True  False  False
2  False   True  False  False
3   True  False   True   True
4  False   True  False  False

In [97]:
df[booldf]

          v         w         x         y
0       NaN       NaN       NaN       NaN
1       NaN  1.925787       NaN       NaN
2       NaN  0.598477       NaN       NaN
3  0.996486       NaN  1.232692  1.390699
4       NaN  1.050522       NaN       NaN

In [98]:
num_list = np.array([1,2,3,4])

In [99]:
bool_list = num_list > 2

In [100]:
bool_list

array([False, False,  True,  True], dtype=bool)

In [101]:
num_list[bool_list]

array([3, 4])

In [102]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [103]:
df[df > 1]

    v         w         x         y
0 NaN       NaN       NaN       NaN
1 NaN  1.925787       NaN       NaN
2 NaN       NaN       NaN       NaN
3 NaN       NaN  1.232692  1.390699
4 NaN  1.050522       NaN       NaN

In [104]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [105]:
df[df['w']>0]

          v         w         x         y
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
4 -0.201879  1.050522 -1.071591 -0.123459

### This is the conditional selection we make the most use of

In [106]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [107]:
df[(df['w']>0) & (df['y']<(-.8))]

Empty DataFrame
Columns: [v, w, x, y]
Index: []

In [108]:
df.T

          0         1         2         3         4
v -1.387738 -0.585942 -0.323312  0.996486 -0.201879
w -0.357408  1.925787  0.598477 -0.221857  1.050522
x -1.746762 -0.773885 -1.029245  1.232692 -1.071591
y -1.425949 -0.132254 -0.138165  1.390699 -0.123459

In [109]:
df

          v         w         x         y
0 -1.387738 -0.357408 -1.746762 -1.425949
1 -0.585942  1.925787 -0.773885 -0.132254
2 -0.323312  0.598477 -1.029245 -0.138165
3  0.996486 -0.221857  1.232692  1.390699
4 -0.201879  1.050522 -1.071591 -0.123459

In [110]:
df.reset_index()

   index         v         w         x         y
0      0 -1.387738 -0.357408 -1.746762 -1.425949
1      1 -0.585942  1.925787 -0.773885 -0.132254
2      2 -0.323312  0.598477 -1.029245 -0.138165
3      3  0.996486 -0.221857  1.232692  1.390699
4      4 -0.201879  1.050522 -1.071591 -0.123459

In [111]:
new_index = "Yo Motha from anotha Brotha".split()

In [112]:
df['new']=new_index

In [113]:
df

          v         w         x         y     new
0 -1.387738 -0.357408 -1.746762 -1.425949      Yo
1 -0.585942  1.925787 -0.773885 -0.132254   Motha
2 -0.323312  0.598477 -1.029245 -0.138165    from
3  0.996486 -0.221857  1.232692  1.390699  anotha
4 -0.201879  1.050522 -1.071591 -0.123459  Brotha

In [114]:
df.set_index('new')

               v         w         x         y
new
Yo     -1.387738 -0.357408 -1.746762 -1.425949
Motha  -0.585942  1.925787 -0.773885 -0.132254
from   -0.323312  0.598477 -1.029245 -0.138165
anotha  0.996486 -0.221857  1.232692  1.390699
Brotha -0.201879  1.050522 -1.071591 -0.123459

## Dataframes part 3

In [115]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index1 = list(zip(outside,inside))
hier_index2 = pd.MultiIndex.from_tuples(hier_index1)

In [116]:
hier_index2

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [117]:
df = pd.DataFrame(np.random.randn(6,2), hier_index2, ['A','B'])

In [118]:
df

             A         B
G1 1  0.777689  0.621857
   2  0.167279 -0.238545
   3 -1.055046 -1.725197
G2 1 -0.737122  0.704106
   2 -0.742126  0.728268
   3  1.824139  1.072546

In [119]:
df.loc['G1']['A']

1    0.777689
2    0.167279
3   -1.055046
Name: A, dtype: float64

In [120]:
df.index.names = ['G strings', 'NumNums']

In [121]:
df

                          A         B
G strings NumNums
G1        1        0.777689  0.621857
          2        0.167279 -0.238545
          3       -1.055046 -1.725197
G2        1       -0.737122  0.704106
          2       -0.742126  0.728268
          3        1.824139  1.072546

In [122]:
df.xs('G2', level='G strings')

                A         B
NumNums
1       -0.737122  0.704106
2       -0.742126  0.728268
3        1.824139  1.072546

In [123]:
df.xs('G1')

                A         B
NumNums
1        0.777689  0.621857
2        0.167279 -0.238545
3       -1.055046 -1.725197

## Missing Data

In [124]:
df = pd.DataFrame({'a':[1,np.nan, 3], 'b':[1,2,3], 'c':[3, np.nan, np.nan]})

In [125]:
df

     a  b    c
0  1.0  1  3.0
1  NaN  2  NaN
2  3.0  3  NaN

In [126]:
df.dropna()

     a  b    c
0  1.0  1  3.0

In [127]:
df.dropna(thresh=2, axis=1)

     a  b
0  1.0  1
1  NaN  2
2  3.0  3

In [128]:
lambda x: df[x].fillna(value=df[x].mean())

In [129]:
for x in range(0,df.size): lambda x: df[x].fillna(value=df[x].mean())

## Groupby

In [130]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [131]:
df = pd.DataFrame(data)

In [132]:
my_cum = df.groupby('Company')

In [133]:
my_cum.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [134]:
my_cum.describe().T['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

## Operations

In [135]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [136]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [137]:
df['col2'].nunique()

3

In [138]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [139]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [140]:
df[ (df['col1']>2) & (df['col2'] > 444) ] #conditional selection reminder

   col1  col2 col3
2     3   666  ghi

In [141]:
def squared(x): 
    return x**2

In [142]:
df['col2'].apply(squared) ##Broadcasts the function to each element in the column

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [143]:
df.apply(len)

col1    4
col2    4
col3    4
dtype: int64

In [144]:
df['col2'].apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [145]:
df.drop('col1', axis=1) #removing columns

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [146]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [147]:
df.columns #retrieving info on collumns

Index(['col1', 'col2', 'col3'], dtype='object')

In [148]:
df.columns[1]

'col2'

In [149]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [150]:
df1 = pd.DataFrame(np.random.rand(4,5), ['a','b','c','d'])

In [153]:
df1.sort_values(1, axis = 0)

          0         1         2         3         4
b  0.478025  0.080012  0.613054  0.403484  0.729268
c  0.015967  0.134957  0.603640  0.262086  0.648074
d  0.670726  0.598924  0.785348  0.303101  0.243062
a  0.472193  0.895228  0.384355  0.952614  0.598988

In [154]:
df1

          0         1         2         3         4
a  0.472193  0.895228  0.384355  0.952614  0.598988
b  0.478025  0.080012  0.613054  0.403484  0.729268
c  0.015967  0.134957  0.603640  0.262086  0.648074
d  0.670726  0.598924  0.785348  0.303101  0.243062

In [155]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Data I/O

In [156]:
pwd

'/home/casper/udemy_data_science_with_python'

In [166]:
csv_df = pd.read_csv('example')

In [176]:
csv_df.to_csv('my_csv', index = False)

In [177]:
pd.read_csv('my_csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [180]:
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [182]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='Sheet2')

In [183]:
pd.read_excel('Excel_Sample2.xlsx', sheetname='Sheet2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [189]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [194]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","May 11, 2017"
1,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","May 23, 2017"
2,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
3,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
4,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
5,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
6,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","April 27, 2017"
7,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
8,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
9,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","March 13, 2017"
10,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016"
11,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
12,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","August 17, 2016"
13,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
14,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"
15,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015"
16,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","April 21, 2015"
17,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","May 8, 2017"
18,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 6, 2016"
19,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
20,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
21,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","March 26, 2015"
22,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
23,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","July 11, 2016"
24,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","March 25, 2016"
25,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","June 29, 2015"
26,Valley Bank,Moline,IL,10450,Great Southern Bank,"June 20, 2014","June 26, 2015"
27,Slavie Federal Savings Bank,Bel Air,MD,32368,"Bay Bank, FSB","May 30, 2014","December 12, 2016"
28,Columbia Savings Bank,Cincinnati,OH,32284,"United Fidelity Bank, fsb","May 23, 2014","November 10, 2016"
29,AztecAmerica Bank En Espanol,Berwyn,IL,57866,Republic Bank of Chicago,"May 16, 2014","October 20, 2016"
...,...,...,...,...,...,...,...
522,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","August 28, 2012"
523,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","August 28, 2012"
524,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
525,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
526,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","August 28, 2012"
527,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
528,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
529,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
530,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","June 5, 2012"
531,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
532,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","July 22, 2005"
533,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
534,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
535,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
536,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
537,AmTrade International Bank En Espanol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
538,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","April 9, 2008"
539,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
540,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
541,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
542,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
543,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
544,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
545,"Hamilton Bank, NA En Espanol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
546,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","February 10, 2004"
547,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
548,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
549,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
550,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
551,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [195]:
from sqlalchemy import create_engine

In [197]:
engine = create_engine('sqlite:///:memory:')

In [198]:
df.to_sql('my_table', engine)

In [199]:
sqldf = pd.read_sql('my_table', con=engine)

In [200]:
sqldf

   index  col1  col2 col3
0      0     1   444  abc
1      1     2   555  def
2      2     3   666  ghi
3      3     4   444  xyz

In [215]:
joke = pd.read_json('http://api.icndb.com/jokes/random')

In [216]:
joke.loc['joke'].value

'It takes Chuck Norris 20 minutes to watch 60 Minutes.'